{"keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block1_conv1", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block1_conv2", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block1_pool", "pool_size": [2, 2], "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block2_conv1", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 128, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block2_conv2", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 128, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block2_pool", "pool_size": [2, 2], "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block3_conv1", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block3_conv2", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block3_conv3", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block3_pool", "pool_size": [2, 2], "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block4_conv1", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block4_conv2", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block4_conv3", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block4_pool", "pool_size": [2, 2], "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block5_conv1", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block5_conv2", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "padding": "same", "name": "block5_conv3", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "filters": 512, "data_format": "channels_last", "trainable": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block5_pool", "pool_size": [2, 2], "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 3}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}}